node {
  name: "model/pl_tokens"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 85
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 85
        }
      }
    }
  }
}
node {
  name: "model/pl_target"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 85
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 85
        }
      }
    }
  }
}
node {
  name: "model/pl_weight"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 85
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 85
        }
      }
    }
  }
}
node {
  name: "model/pl_keep_prob"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "model/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/Sum"
  op: "Sum"
  input: "model/pl_weight"
  input: "model/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\365\003\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05441967025399208
      }
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05441967025399208
      }
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/emb/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/sub"
  op: "Sub"
  input: "model/emb/Initializer/random_uniform/max"
  input: "model/emb/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform/mul"
  op: "Mul"
  input: "model/emb/Initializer/random_uniform/RandomUniform"
  input: "model/emb/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/emb/Initializer/random_uniform"
  op: "Add"
  input: "model/emb/Initializer/random_uniform/mul"
  input: "model/emb/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/emb"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1013
        }
        dim {
          size: 40
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/emb/Assign"
  op: "Assign"
  input: "model/emb"
  input: "model/emb/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/emb/read"
  op: "Identity"
  input: "model/emb"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1013
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/embedding_lookup/axis"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "model/embedding_lookup"
  op: "GatherV2"
  input: "model/emb/read"
  input: "model/pl_tokens"
  input: "model/embedding_lookup/axis"
  attr {
    key: "Taxis"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 85
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/unstack"
  op: "Unpack"
  input: "model/embedding_lookup"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 1
    }
  }
  attr {
    key: "num"
    value {
      i: 85
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/Shape"
  op: "Shape"
  input: "model/unstack"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout/random_uniform/max"
  input: "model/sequence_dropout/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout/random_uniform/mul"
  input: "model/sequence_dropout/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/div"
  op: "RealDiv"
  input: "model/unstack"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout/div"
  input: "model/sequence_dropout/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/Shape"
  op: "Shape"
  input: "model/unstack:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout_1/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout_1/random_uniform/max"
  input: "model/sequence_dropout/dropout_1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_1/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout_1/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout_1/random_uniform/mul"
  input: "model/sequence_dropout/dropout_1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout_1/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/div"
  op: "RealDiv"
  input: "model/unstack:1"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_1/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_1/div"
  input: "model/sequence_dropout/dropout_1/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/Shape"
  op: "Shape"
  input: "model/unstack:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout_2/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout_2/random_uniform/max"
  input: "model/sequence_dropout/dropout_2/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_2/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout_2/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout_2/random_uniform/mul"
  input: "model/sequence_dropout/dropout_2/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout_2/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/div"
  op: "RealDiv"
  input: "model/unstack:2"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_2/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_2/div"
  input: "model/sequence_dropout/dropout_2/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/Shape"
  op: "Shape"
  input: "model/unstack:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout_3/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout_3/random_uniform/max"
  input: "model/sequence_dropout/dropout_3/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_3/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout_3/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout_3/random_uniform/mul"
  input: "model/sequence_dropout/dropout_3/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout_3/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout_3/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/div"
  op: "RealDiv"
  input: "model/unstack:3"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_3/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_3/div"
  input: "model/sequence_dropout/dropout_3/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/Shape"
  op: "Shape"
  input: "model/unstack:4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout_4/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout_4/random_uniform/max"
  input: "model/sequence_dropout/dropout_4/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_4/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout_4/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout_4/random_uniform/mul"
  input: "model/sequence_dropout/dropout_4/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout_4/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout_4/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/div"
  op: "RealDiv"
  input: "model/unstack:4"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_4/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_4/div"
  input: "model/sequence_dropout/dropout_4/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/Shape"
  op: "Shape"
  input: "model/unstack:5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/sequence_dropout/dropout_5/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform/sub"
  op: "Sub"
  input: "model/sequence_dropout/dropout_5/random_uniform/max"
  input: "model/sequence_dropout/dropout_5/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_5/random_uniform/RandomUniform"
  input: "model/sequence_dropout/dropout_5/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/random_uniform"
  op: "Add"
  input: "model/sequence_dropout/dropout_5/random_uniform/mul"
  input: "model/sequence_dropout/dropout_5/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/add"
  op: "Add"
  input: "model/pl_keep_prob"
  input: "model/sequence_dropout/dropout_5/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/Floor"
  op: "Floor"
  input: "model/sequence_dropout/dropout_5/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/div"
  op: "RealDiv"
  input: "model/unstack:5"
  input: "model/pl_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_5/mul"
  op: "Mul"
  input: "model/sequence_dropout/dropout_5/div"
  input: "model/sequence_dropout/dropout_5/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 40
          }
        }
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_6/Shape"
  op: "Shape"
  input: "model/unstack:6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_6/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/sequence_dropout/dropout_6/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
